#+TITLE: A litterate programming approach to customize emacs
#+AUTHOR: Alex Patry
#+EMAIL: alex@nlpfu.com

* Mu4e

[[https://www.djcbsoftware.nl/code/mu/mu4e/][mu4e]] is a mode to read emails in emacs. My config relies on =mbsync=
to fetch emails. We assume that it has been setup properly. A good
starting point is available [[https://rakhim.org/fastmail-setup-with-emacs-mu4e-and-mbsync-on-macos/][here]].

#+begin_src emacs-lisp
  (when (and (file-directory-p "/usr/share/emacs/site-lisp/mu4e")
	     (file-directory-p "~/Maildir"))

    ;; we assume that mu and mu4e have been installed already using our
    ;; package manager (e.g. apt install mu4e)
    (add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e")
    (require 'mu4e)

    (setq mu4e-contexts
	  `(,(make-mu4e-context
	      :name "fastmail"
	      :enter-func (lambda () (mu4e-message "Entering fastmail context"))
	      :leave-func (lambda () (mu4e-message "Leaving fastmail context"))
	      :match-func (lambda (msg)
			    (when msg
			      (string-match-p "^/fastmail/" (mu4e-message-field msg :maildir))))
	      :vars '((user-mail-address . "alex@nlpfu.com")
		      (user-full-name . "Alexandre Patry")

		      ;; configure mu4e imap directory
		      (mu4e-sent-folder . "/fastmail/Sent Items")
		      (mu4e-refile-folder . "/fastmail/Archive")
		      (mu4e-drafts-folder . "/fastmail/Drafts")
		      (mu4e-trash-folder . "/fastmail/Trash")

		      ;; mu4e shortcut (e.g. ji will jump to inbox)
		      (mu4e-maildir-shortcuts .
		       (("/fastmail/INBOX" . ?i)
			("/fastmail/Sent Items" . ?s)
			("/fastmail/Trash" . ?t)
			("/fastmail/Drafts". ?d)))

		      ;; set smtp server
		      (smtpmail-default-smtp-server . "smtp.fastmail.com")
		      (smtpmail-smtp-server . "smtp.fastmail.com")
		      (smtpmail-stream-type . starttls)
		      (smtpmail-smtp-service . 587)))

	    ,(make-mu4e-context
	      :name "gmail"
	      :enter-func (lambda () (mu4e-message "Entering gmail context"))
	      :leave-func (lambda () (mu4e-message "Leaving gmail context"))
	      :match-func (lambda (msg)
			    (when msg
			      (string-match-p "^/gmail/" (mu4e-message-field msg :maildir))))
	      :vars '((user-mail-address . "textjuicer@gmail.com")
		      (user-full-name . "Alexandre Patry")

		      ;; configure mu4e imap directory
		      (mu4e-sent-folder . "/gmail/[Gmail]/Messages envoy&AOk-s")
		      (mu4e-drafts-folder . "/gmail/[Gmail]/Brouillons")
		      (mu4e-trash-folder . "/gmail/[Gmail]/Corbeille")

		      ;; mu4e shortcut (e.g. ji will jump to inbox)
		      (mu4e-maildir-shortcuts .
		       (("/gmail/INBOX" . ?i)
			("/gmail/[Gmail]/Messages envoy&AOk-s" . ?s)
			("/gmail/[Gmail]/Corbeille" . ?t)
			("/gmail/[Gmain]/Brouillons". ?d)))

		      ;; set smtp server
		      (smtpmail-smtp-server . "smtp.gmail.com")
		      (smtpmail-stream-type . starttls)
		      (smtpmail-smtp-service . 587)))))

    (setq mail-user-agent 'mu4e-user-agent)
    (setq message-send-mail-function 'smtpmail-send-it)

    (setq
     ;; location for downloaded attachments
     mu4e-attachments-dir "~/Downloads"

     ;; command to update emails every 5 minutes (300 seconds)
     mu4e-get-mail-command "mbsync -a"
     mu4e-update-interval 300

     ;; rename filse when moving (required by mbsync)
     mu4e-change-filenames-when-moving t

     ;; faster re-indexing of emails
     mu4e-index-cleanup nil
     mu4e-index-lazy-check t

     ;; let the recipient adjust the text width
     mu4e-compose-format-flowed t

     ;; ui
     mu4e-view-show-images t)

    ;; configure imagemagick to handle images
    (when (fboundp 'imagemagick-register-types)
      (imagemagick-register-types))


    ;; Allows to view email in browser
    (add-to-list 'mu4e-view-actions
		 '("browser view" . mu4e-action-view-in-browser) t)
    (add-to-list 'mu4e-view-actions
		 '("xwidget" . mu4e-action-view-with-xwidget) t)

    ;; run mu4e in the background at startup
    (mu4e-context-switch nil "fastmail")
    (mu4e t))
#+end_src

#+RESULTS:
: 587

* Python

Let's start by installing modes for python and python documentation:

#+BEGIN_SRC emacs-lisp
  (use-package python
    :mode ("\\.py\\'" . python-mode)
    :config
    (setq
     python-indent-guess-indent-offset nil
     python-indent-offset 4)
    (when (executable-find "ipython3")
      (setq python-shell-interpreter "ipython3"
	    python-shell-interpreter-args "-i --simple-prompt --gui=tk ")))

  (use-package python-docstring
    :hook ((python-mode . python-docstring-mode))
    :ensure t)

  (use-package python-black
    :after python
    :ensure t
    :hook ((python-mode . python-black-on-save-mode)))

  (use-package py-isort
    :after python
    :ensure t
    :hook (python-mode . py-isort-before-save)
    :config
    (setq py-isort-options '("--profile=black")))
#+END_SRC

#+RESULTS:
| py-isort-before-save | py-isort-enable-on-save | python-black-on-save-mode | python-docstring-mode | doom-modeline-env-setup-python | (lambda nil (require (quote lsp-python-ms)) (lsp)) |

